---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstraint.TargetRebarConstraintTypeIsEdge
source: html/c9018a04-ebe1-3214-9e4b-7853a79be53c.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraint.TargetRebarConstraintTypeIsEdge Method

Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar,'
 and the RebarConstraint is attached to an edge of the other Rebar Element.

## Syntax (C#)
```csharp
public bool TargetRebarConstraintTypeIsEdge()
```